[
    {
        "id": 1,
        "name": "Iphone 12",
        "price": 685,
        "stock": 5,
        "category": "iphone",
        "description": "El iPhone 12 se estrenó con iOS 14 y funciona con el procesador Apple A14 Bionic. Soporta redes 5G para mayor velocidad, con la capacidad de cambiar automáticamente a LTE según sea necesario para conservar la vida útil de la batería. La pantalla contiene aproximadamente el doble de píxeles que el iPhone 11 con una relación de contraste de 2,000,000:1 y un rendimiento de caída 4 veces superior al de los modelos anteriores. El sistema de doble cámara orientado hacia atrás incluye una lente ultra ancha y lente gran angular. Las bobinas cambiantes inalámbricas dentro del teléfono incluyen MagSafe para la alineación magnética y la conexión de cargadores y accesorios. El conector Lightning actualizado admite una carga más rápida a través de USB-C.",
        "imageUrl": "/i12-black.png",
        "imageAll": "/iphone12-all.png"
    },
    {
        "id": 2,
        "name": "Iphone 13",
        "price": 815,
        "stock": 20,
        "category": "iphone",
        "description": "Este dispositivo utiliza el procesador Apple A15 Bionic y soporta redes 5G. Su diseño es muy similar a su antecesor. Entre sus diferencias destacan nuevo sistema de cámaras puestas de forma diagonal, teniendo los iPhone anteriores las cámaras puestas verticalmente, el notch es más pequeño que el de los iPhones anteriores y su batería dura 1 hora y media más que la de iPhone 12. Tiene pantalla de 60Hz y conector Lightning.",
        "imageUrl": "/i13-blue.png",
        "imageAll": "/iphone13-all.png"
    },
    {
        "id": 3,
        "name": "Iphone 14",
        "price": 900,
        "stock": 38,
        "category": "iphone",
        "description": "El iPhone 14 es un teléfono inteligente diseñado y desarrollado por Apple, es la decimoséptima generación de iPhones, siendo así sucesor del IPhone 13. Fueron anunciados en el Apple Event en el Apple Park en Cupertino, California el 7 de septiembre de 2022, junto a los productos insignias iPhone 14 Pro con un precio aún superior y el iPhone 14 Pro Max. El iPhone 14 (que es prácticamente igual que su antecesor, el iPhone 13) y el iPhone 14 Pro cuentan con una pantalla de 6,1 pulgadas (15 cm) y 6,7 pulgadas (17 cm), mejoras en la cámara trasera y conectividad satelital. El iPhone 14 y su versión Pro estarán disponibles el 16 de septiembre de 2022 y el 7 de octubre de 2022 respectivamente, y se lanzarán con la actualización de iOS 16. Los pedidos anticipados para el iPhone 14 y el iPhone 14 Plus comenzarán el 9 de septiembre de este mismo año.",
        "imageUrl": "/i14-midnight.png",
        "imageAll": "/iphone14-all.png"
    },
    {
        "id": 4,
        "name": "Iphone 14 PRO",
        "price": 1140,
        "stock": 35,
        "category": "iphone",
        "description": "El iPhone 14 Pro y el iPhone 14 Pro Max son teléfonos inteligentes de gama alta diseñados y cormercializados por Apple Inc.. Son la decimosexta generación de iPhone, que viene a partir del iPhone 13 Pro y iPhone 13 Pro Max. Los dispositivos fueron presentados junto con el iPhone 14 y iPhones 14 Plus en el Apple Event en Apple Park en Cupertino, California el 7 de septiembre de 2022 y estarán disponibles el 16 de septiembre de 2022. Los iPhone 14 Pro y el iPhone 14 Pro Max son los primeros en tener un nuevo tipo de pantalla recortada 'Dynamic Island'. Los iPhone 14 Pro y el iPhone 14 Pro Max (incluyendo el iPhone 14 y 14 Plus) ya no aceptan tarjetas SIM físicas, convirtiéndose en los primeros modelos desde la variante CDMA del iphone 4 que no traen con un lector de tarjetas SIM. Actualmente, muchos expertos en tecnología consideran al iPhone 14 Pro Max como el mejor teléfono del mercado, debido a sus prestaciones sobresalientes respecto a su competencia, como la mejor duración de batería, el mejor rendimiento, la mejor grabación de video y la mejor calidad de pantalla.",
        "imageUrl": "/i14pro-black.png",
        "imageAll": "/iphone14pro-all.png"
    },
    {
        "id": 5,
        "name": "Macbook Air",
        "price": 1000,
        "stock": 5,
        "category": "macbook",
        "description": "El MacBook Air es el primero de los portátiles ultraligeros lanzados al mercado por Apple. Éste fue presentado en 2008 y puesto a la venta el 28 de julio de 2008. La principal característica es que se convertía en el portátil más delgado del mercado en su momento, con una delgadez extrema y un peso de tan sólo 1,08 Kg para la versión de 11 pulgadas y 1,35 Kg para la versión de 13 pulgadas. Además, fue el primero de los ordenadores presentados por Apple que disponía de forma predeterminada de memorias de almacenamiento SSD, que ofrecen un rendimiento muy superior al que nos encontramos en los discos duros mecánicos que se comercializaban hasta la fecha.",
        "imageUrl": "/mac-air.png",
        "imageAll": "/mac-air1.png"
    },
    {
        "id": 6,
        "name": "Macbook Pro",
        "price": 1500,
        "stock": 7,
        "category": "macbook",
        "description": "Los nuevos MacBook Pro con Touch Bar de 13 pulgadas y 15 pulgas han actualizado las especificaciones internas para mejorar el rendimiento y sacarle el máximo partido. Lo primero de todo, un nuevo procesador Intel Core de 8ª generación con hasta 6 núcleos en el modelo de 15 pulgadas. No solo procesador, también la memoria RAM sube hasta los 32 GB mientras que el almacenamiento puede ser de hasta 4 TB de SSD. También trae el chip T2 que tenemos en los iMac Pro y que no solo mejoran en seguridad sino que además permiten usar 'Oye Siri'.",
        "imageUrl": "/mac-pro.png",
        "imageAll": "/mac-pro1.png"
    },
    {
        "id": 7,
        "name": "Ipad 10",
        "price": 500,
        "stock": 45,
        "category": "accesorios",
        "description": "Lanzado al mercado en octubre de 2022, se distingue por eliminar el conector Lightning de los iPad que le precedieron y emplear, por el contrario, el enchufe USB-C, cuyo uso la UE impone obligatoriamente a partir de 2024. Paradójicamente, iPad 10 es compatible únicamente con el lápiz de Apple de primera generación, el cual requiere un enchufe Lightning, por lo que quien adquiera ambos productos deberá disponer de dos cargadores y de dos cables. Es el primer iPad cuya cámara frontal está ubicada a lo largo del borde largo del dispositivo",
        "imageUrl": "/ipad.png",
        "imageAll": "/ipad1.png"
    },
    {
        "id": 8,
        "name": "Airpods Pro",
        "price": 350,
        "stock": 40,
        "category": "accesorios",
        "description": "Los Apple AirPods Pro son los auriculares más recientes y avanzados diseñados por Apple. Estos auriculares están diseñados para brindar comodidad y buena calidad de sonido, con cancelación activa de ruido y modo de transparencia disponibles. Los AirPods Pro vienen con dos auriculares de silicona que se pueden ajustar para adaptarse al contorno de su oído, lo que asegura sus AirPods Pro y establece un sello excepcional para mejorar la cancelación de ruido. El estuche de carga prolonga la duración de la batería de los AirPods Pro en más de 24 horas y se puede cargar con una almohadilla de carga inalámbrica o el puerto Lightning. La calidad de audio es de primera categoría, con un controlador de alta excursión y baja distorsión que produce graves potentes. El ecualizador adaptativo adapta automáticamente la música para adaptarse a la forma de su oído para una experiencia auditiva rica y consistente. AirPods Pro también ofrece personalización, con la opción de cambiar entre cancelación de ruido y modo de transparencia.",
        "imageUrl": "/airpods.png",
        "imageAll": "/airpods1.png"
    },
    {
        "id": 9,
        "name": "Smartwatch",
        "price": 200,
        "stock": 10,
        "category": "accesorios",
        "description": "El Apple Watch Series 8 se muestra conservador en cuanto al diseño, respetando la línea vista en anteriores generaciones, así como prestaciones similares a sus predecesores a nivel de sensores y funciones relacionadas con la salud y deporte. No obstante, cuenta con un nuevo sensor: el de temperatura. Apple lo ha promocionado poniendo de ejemplo el ciclo de ovulación de las mujeres, pero la información que obtenga se podrá complementar con otros sensores para un análisis de salud más detallado.",
        "imageUrl": "/applewatch.png",
        "imageAll": "/applewatch1.png"
    }    
]